# SetupBrowserData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExternalResourceServer..::..SetupBrowserData Method
IExternalResourceServer Interface See Also
---
Implement this method to setup external resource browser data which will be accessed in Revit external resource browser UI.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
void SetupBrowserData(
	ExternalResourceBrowserData browseData
)
```

Visual Basic
---
```text
Sub SetupBrowserData ( _
	browseData As ExternalResourceBrowserData _
)
```

Visual C++
---
```text
void SetupBrowserData(
	ExternalResourceBrowserData^ browseData
)
```

# ### Parameters
browseData
    Type: Autodesk.Revit.DB..::..ExternalResourceBrowserData The input context to match the external resources and browser results returned by the server.
# Remarks
If errors occur during setup, store this information externally, and then retrieve and deal with the errors during the call to HandleBrowseResult() of your IExternalResourceUIServer.
# See Also
IExternalResourceServer Interface
Autodesk.Revit.DB Namespace